In [ ]:
import pandas as pd

azuna_df = pd.read_csv("./../data/adzuna_jobs_20250418.csv")
azuna_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 25 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   id                      2 non-null      int64
 1   source                  2 non-null      object
 2   title                   2 non-null      object
 3   description             2 non-null      object
 4   company_name            2 non-null      object
 5   location_name           2 non-null      object
 6   latitude                2 non-null      float64
 7   longitude               2 non-null      float64
 8   date_created            2 non-null      object
 9   date_updated            2 non-null      object
 10  contract_type           1 non-null      object
 11  contract_duration       0 non-null      float64
 12  working_hours           0 non-null      float64
 13  salary_min              1 non-null      float64
 14  salary_max              1 non-null      float64
 15  salary_currency         2 non-null      object
 16  salary_period           2 non-null      object
 17  experience_required     2 non-null      object
 18  category                2 non-null      object
 19  sector                  0 non-null      float64
 20  application_url         2 non-null      object
 21  source_url              2 non-null      object
 22  skills                  0 non-null      float64
 23  remote_work             0 non-null      float64
 24  is_handicap_accessible  0 non-null      float64
dtypes: float64(10), int64(1), object(14)
memory usage: 532.0+ bytes

In [23]:
azuna_df.describe()

,id,latitude,longitude,contract_duration,working_hours,salary_min,salary_max,sector,skills,remote_work,is_handicap_accessible
count,2.000000e+00,2.000000,2.000000,0.0,0.0,1.0,1.0,0.0,0.0,0.0,0.0
mean,5.086109e+09,48.863839,2.344631,NaN,NaN,40000.0,58000.0,NaN,NaN,NaN,NaN
std,6.920042e+07,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,5.037177e+09,48.863839,2.344631,NaN,NaN,40000.0,58000.0,NaN,NaN,NaN,NaN
25%,5.061643e+09,48.863839,2.344631,NaN,NaN,40000.0,58000.0,NaN,NaN,NaN,NaN
50%,5.086109e+09,48.863839,2.344631,NaN,NaN,40000.0,58000.0,NaN,NaN,NaN,NaN
75%,5.110575e+09,48.863839,2.344631,NaN,NaN,40000.0,58000.0,NaN,NaN,NaN,NaN
max,5.135041e+09,48.863839,2.344631,NaN,NaN,40000.0,58000.0,NaN,NaN,NaN,NaN

In [19]:
france_travail = pd.read_csv("./../data/france_travail_jobs_20250418.csv")
france_travail.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 25 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   id                      11 non-null     object
 1   source                  11 non-null     object
 2   title                   11 non-null     object
 3   description             11 non-null     object
 4   company_name            9 non-null      object
 5   location_name           11 non-null     object
 6   latitude                11 non-null     float64
 7   longitude               11 non-null     float64
 8   date_created            0 non-null      float64
 9   date_updated            0 non-null      float64
 10  contract_type           11 non-null     object
 11  contract_duration       9 non-null      object
 12  working_hours           4 non-null      object
 13  salary_min              5 non-null      float64
 14  salary_max              5 non-null      float64
 15  salary_currency         11 non-null     object
 16  salary_period           5 non-null      object
 17  experience_required     11 non-null     object
 18  category                11 non-null     object
 19  sector                  7 non-null      object
 20  application_url         1 non-null      object
 21  source_url              11 non-null     object
 22  skills                  4 non-null      object
 23  remote_work             0 non-null      float64
 24  is_handicap_accessible  11 non-null     bool
dtypes: bool(1), float64(7), object(17)
memory usage: 2.2+ KB

In [24]:
france_travail.describe()

,latitude,longitude,date_created,date_updated,salary_min,salary_max,remote_work
count,11.000000,11.000000,0.0,0.0,5.0000,5.000000,0.0
mean,44.622619,6.562735,NaN,NaN,13845.5980,16023.198000,NaN
std,14.030976,14.034248,NaN,NaN,17136.4442,19695.068446,NaN
min,2.317650,2.267032,NaN,NaN,487.0000,775.000000,NaN
25%,48.841620,2.318223,NaN,NaN,1200.0000,1800.000000,NaN
50%,48.854042,2.347000,NaN,NaN,2540.9900,2540.990000,NaN
75%,48.859000,2.356841,NaN,NaN,30000.0000,35000.000000,NaN
max,48.867669,48.877479,NaN,NaN,35000.0000,40000.000000,NaN

In [25]:
all_jobs = pd.read_csv("./../data/all_jobs_20250418.csv")
all_jobs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 25 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   id                      13 non-null     object
 1   source                  13 non-null     object
 2   title                   13 non-null     object
 3   description             13 non-null     object
 4   company_name            11 non-null     object
 5   location_name           13 non-null     object
 6   latitude                13 non-null     float64
 7   longitude               13 non-null     float64
 8   date_created            2 non-null      object
 9   date_updated            2 non-null      object
 10  contract_type           12 non-null     object
 11  contract_duration       9 non-null      object
 12  working_hours           4 non-null      object
 13  salary_min              6 non-null      float64
 14  salary_max              6 non-null      float64
 15  salary_currency         13 non-null     object
 16  salary_period           7 non-null      object
 17  experience_required     13 non-null     object
 18  category                13 non-null     object
 19  sector                  7 non-null      object
 20  application_url         3 non-null      object
 21  source_url              13 non-null     object
 22  skills                  4 non-null      object
 23  remote_work             0 non-null      float64
 24  is_handicap_accessible  11 non-null     object
dtypes: float64(5), object(20)
memory usage: 2.7+ KB

In [26]:
all_jobs.describe()

        latitude  longitude   salary_min    salary_max  remote_work
count  13.000000  13.000000      6.00000      6.000000          0.0
mean   45.275114   5.913796  18204.66500  23019.331667          NaN
std    12.907117  12.909013  18679.80103  24576.246552          NaN
min     2.317650   2.267032    487.00000    775.000000          NaN
25%    48.841620   2.341157   1535.24750   1985.247500          NaN
50%    48.856305   2.344631  16270.49500  18770.495000          NaN
75%    48.863839   2.356841  33750.00000  38750.000000          NaN
max    48.867669  48.877479  40000.00000  58000.000000          NaN